# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [1]:
cd C:\Users\mbuck\Documents\Matt's Files\Personal\School\Data Bootcamp

C:\Users\mbuck\Documents\Matt's Files\Personal\School\Data Bootcamp

In [2]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import scipy.stats as sts

# File to Load (Remember to change these)
city_data_to_load = "Downloads/city_data.csv"
ride_data_to_load = "Downloads/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [3]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [4]:
#  1. Get the total rides for each city type
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

urban_ride_total = urban_cities_df.groupby(["city"]).count()["ride_id"]
suburban_ride_total = suburban_cities_df.groupby(["city"]).count()["ride_id"]
rural_ride_total = rural_cities_df.groupby(["city"]).count()["ride_id"]

In [5]:
# 2. Get the total drivers for each city type
urban_driver_total = urban_cities_df.groupby(["city"]).mean()["driver_count"]
suburban_driver_total = suburban_cities_df.groupby(["city"]).mean()["driver_count"]
rural_driver_total = rural_cities_df.groupby(["city"]).mean()["driver_count"]
rural_driver_total.sum()

78.0

In [6]:
#  3. Get the total amount of fares for each city type
urban_fares_total = urban_cities_df.groupby(["city"]).sum()["fare"]
suburban_fares_total = suburban_cities_df.groupby(["city"]).sum()["fare"]
rural_fares_total = rural_cities_df.groupby(["city"]).sum()["fare"]
urban_fares_total.sum()

39854.38000000001

In [7]:
#  4. Get the average fare per ride for each city type. 
avg_urban_fare_per_ride = urban_fares_total.sum() / urban_ride_total.sum()
avg_suburban_fare_per_ride = suburban_fares_total.sum() / suburban_ride_total.sum()
avg_rural_fare_per_ride = rural_fares_total.sum() / rural_ride_total.sum()

In [8]:
# 5. Get the average fare per driver for each city type. 
avg_urban_fare_per_driver = urban_fares_total.sum() / urban_driver_total.sum()
avg_suburban_fare_per_driver = suburban_fares_total.sum() / suburban_driver_total.sum()
avg_rural_fare_per_driver = rural_fares_total.sum() / rural_driver_total.sum()

In [9]:
# 6. Create a PyBer Summary DataFrame
pyber_summary_df = pd.DataFrame({"type": ["Rural", "Suburban", "Urban"], "Total Rides": [rural_ride_total.sum(), suburban_ride_total.sum(),urban_ride_total.sum()],
                                 "Total Drivers": [rural_driver_total.sum(),suburban_driver_total.sum(),urban_driver_total.sum()],
                                "Total Fares": [rural_fares_total.sum(),suburban_fares_total.sum(),urban_fares_total.sum()], 
                                 "Average Fare per Ride": [avg_rural_fare_per_ride, avg_suburban_fare_per_ride, avg_urban_fare_per_ride],
                                "Average Fare per Driver": [avg_rural_fare_per_driver, avg_suburban_fare_per_driver, avg_urban_fare_per_driver]})
pyber_summary_df

,type,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
0,Rural,125,78.0,4327.93,34.623440,55.486282
1,Suburban,625,490.0,19356.33,30.970128,39.502714
2,Urban,1625,2405.0,39854.38,24.525772,16.571468

In [10]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
pyber_summary_df

,type,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
0,Rural,125,78.0,4327.93,34.623440,55.486282
1,Suburban,625,490.0,19356.33,30.970128,39.502714
2,Urban,1625,2405.0,39854.38,24.525772,16.571468

In [11]:
#  8. Format the columns.

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [12]:
# 1. Read the merged DataFrame
df = pyber_data_df.groupby(["type","date"]).sum()[["fare"]]
df.tail(10)

                            fare
type  date
Urban 2019-05-07 17:27:48   6.39
      2019-05-07 20:05:15  24.20
      2019-05-07 20:22:19  18.74
      2019-05-08 01:54:18  32.69
      2019-05-08 02:31:25  41.33
      2019-05-08 04:20:00  21.99
      2019-05-08 04:39:49  18.45
      2019-05-08 07:29:01  18.55
      2019-05-08 11:38:35  19.77
      2019-05-08 13:10:18  18.04

In [13]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

In [14]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
df = df.reset_index()
df.tail(10)

       type                 date   fare
2365  Urban  2019-05-07 17:27:48   6.39
2366  Urban  2019-05-07 20:05:15  24.20
2367  Urban  2019-05-07 20:22:19  18.74
2368  Urban  2019-05-08 01:54:18  32.69
2369  Urban  2019-05-08 02:31:25  41.33
2370  Urban  2019-05-08 04:20:00  21.99
2371  Urban  2019-05-08 04:39:49  18.45
2372  Urban  2019-05-08 07:29:01  18.55
2373  Urban  2019-05-08 11:38:35  19.77
2374  Urban  2019-05-08 13:10:18  18.04

In [15]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
fares_sum_pivot = df.pivot(index='date',columns='type',values='fare')
fares_sum_pivot.tail(10)

type                 Rural  Suburban  Urban
date
2019-05-07 20:05:15    NaN       NaN  24.20
2019-05-07 20:22:19    NaN       NaN  18.74
2019-05-07 20:40:29    NaN     24.89    NaN
2019-05-08 01:54:18    NaN       NaN  32.69
2019-05-08 02:31:25    NaN       NaN  41.33
2019-05-08 04:20:00    NaN       NaN  21.99
2019-05-08 04:39:49    NaN       NaN  18.45
2019-05-08 07:29:01    NaN       NaN  18.55
2019-05-08 11:38:35    NaN       NaN  19.77
2019-05-08 13:10:18    NaN       NaN  18.04

In [23]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.


df['date'] = pd.to_datetime(df['date'])
df_range = (df['date'] > '2019-01-01') & (df['date'] <= '2019-04-29')
df.loc[df_range].pivot(index='date',columns='type',values='fare')

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-04-28 14:28:36    NaN       NaN  11.46
2019-04-28 16:29:16    NaN       NaN  36.42
2019-04-28 17:26:52    NaN       NaN  31.43
2019-04-28 17:38:09    NaN     34.87    NaN
2019-04-28 19:35:03    NaN     16.96    NaN

[2196 rows x 3 columns]

In [28]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

df_range.index = pd.to_datetime(df.index)

In [30]:
# 7. Check that the datatype for the index is datetime using df.info()
df_range.info

<bound method Series.info of 1970-01-01 00:00:00.000000000     True
1970-01-01 00:00:00.000000001     True
1970-01-01 00:00:00.000000002     True
1970-01-01 00:00:00.000000003     True
1970-01-01 00:00:00.000000004     True
                                 ...
1970-01-01 00:00:00.000002370    False
1970-01-01 00:00:00.000002371    False
1970-01-01 00:00:00.000002372    False
1970-01-01 00:00:00.000002373    False
1970-01-01 00:00:00.000002374    False
Name: date, Length: 2375, dtype: bool>

In [31]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.
fares_by_week = df_range.resample("W").sum()
fares_by_week.head(10)

1970-01-04    2196
Freq: W-SUN, Name: date, dtype: int64

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')